Repository: dukebody/acentoweb.competition
Catalog: acentoweb/competition/i18n/plone-acentoweb.competition-*.po
Languages: es

source: help_location_creation
es: Introduzca su localidad

source: label_phone_no
es: Teléfono

source: help_phone_no_creation
es: Introduzca su número de teléfono

source: Competition
es: Concurso

source: Open
es: Abierto

source: Open the competition to start accepting works.
es: Abrir el concurso para iniciar la aceptación de trabajos.

source: Close
es: Cerrar

source: Close the competition so no more works are accepted.
es: Cerrar el concurso para no aceptar más trabajos.

source: Closed
es: Cerrado

source: Photo
es: Fotografía

source: A photo, to be submitted to a competition.
es: Una fotografía, para ser enviada a un concurso.

source: Video
es: Vídeo

source: A video to be submitted to a competition.
es: Un vídeo para ser enviado a un concurso

source: Story
es: Relato

source: A story, to be submitted to a competition.
es: Un relato, para ser enviado a un concurso.

source: Submit to the competition
es: Enviar al concurso

source: Submit your item for the judge to review and rate it.
es: Envía tu trabajo para que el Jurado pueda revisarlo y puntuarlo.

source: Competing
es: Concursando
